2023/ycsb/mongodb/dbaas-navigator_ycsb_mongodb-documentdb-aws_1_qPBTxY4x/0_load.txt
bin/ycsb load mongodb -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p mongodb.url=mongodb://root:pCm9YZpSAres@dbaas-navigator-9c1ff8c3-980e-5900-99f1-395e9ba19cb2.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin -p batchsize=100 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=10000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3
/usr/java/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/mongodb-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/core-0.17.0.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/binary/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/binary/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/binary/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/binary/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://root:pCm9YZpSAres@dbaas-navigator-9c1ff8c3-980e-5900-99f1-395e9ba19cb2.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin -p batchsize=100 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=10000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://root:pCm9YZpSAres@dbaas-navigator-9c1ff8c3-980e-5900-99f1-395e9ba19cb2.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin -p batchsize=100 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=10000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2023-01-09 12:06:07:659 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://root:pCm9YZpSAres@dbaas-navigator-9c1ff8c3-980e-5900-99f1-395e9ba19cb2.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2023-01-09 12:06:17:644 10 sec: 168100 operations; 16810 current ops/sec; est completion in 9 minutes [INSERT: Count=168100, Max=2269183, Min=6, Avg=5467.8, 90=13, 99=6723, 99.9=1124351, 99.99=1690623] 
2023-01-09 12:06:27:644 20 sec: 347600 operations; 17950 current ops/sec; est completion in 9 minutes [INSERT: Count=179500, Max=2029567, Min=6, Avg=5565.88, 90=8, 99=16799, 99.9=1093631, 99.99=1713151] 
2023-01-09 12:06:37:644 30 sec: 526200 operations; 17860 current ops/sec; est completion in 9 minutes [INSERT: Count=178600, Max=2146303, Min=6, Avg=5588.42, 90=9, 99=10679, 99.9=1107967, 99.99=1674239] 
2023-01-09 12:06:47:644 40 sec: 704700 operations; 17850 current ops/sec; est completion in 8 minutes [INSERT: Count=178500, Max=2215935, Min=6, Avg=5633.95, 90=10, 99=10807, 99.9=1136639, 99.99=1734655] 
2023-01-09 12:06:57:644 50 sec: 883700 operations; 17900 current ops/sec; est completion in 8 minutes [INSERT: Count=179000, Max=2185215, Min=6, Avg=5570.56, 90=9, 99=20751, 99.9=1096703, 99.99=1700863] 
2023-01-09 12:07:07:644 60 sec: 1062400 operations; 17870 current ops/sec; est completion in 8 minutes [INSERT: Count=178700, Max=2637823, Min=6, Avg=5626.25, 90=10, 99=19999, 99.9=1142783, 99.99=1762303] 
2023-01-09 12:07:17:644 70 sec: 1241200 operations; 17880 current ops/sec; est completion in 8 minutes [INSERT: Count=178800, Max=2650111, Min=6, Avg=5528.95, 90=7, 99=20287, 99.9=1101823, 99.99=1714175] 
2023-01-09 12:07:27:644 80 sec: 1421400 operations; 18020 current ops/sec; est completion in 8 minutes [INSERT: Count=180200, Max=2340863, Min=6, Avg=5599.08, 90=9, 99=5335, 99.9=1101823, 99.99=1662975] 
2023-01-09 12:07:37:644 90 sec: 1601200 operations; 17980 current ops/sec; est completion in 7 minutes [INSERT: Count=179800, Max=2187263, Min=6, Avg=5599.48, 90=9, 99=20287, 99.9=1120255, 99.99=1692671] 
2023-01-09 12:07:47:644 100 sec: 1779900 operations; 17870 current ops/sec; est completion in 7 minutes [INSERT: Count=178700, Max=2353151, Min=6, Avg=5552.13, 90=8, 99=20831, 99.9=1121279, 99.99=1598463] 
2023-01-09 12:07:57:644 110 sec: 1960000 operations; 18010 current ops/sec; est completion in 7 minutes [INSERT: Count=180100, Max=2017279, Min=6, Avg=5527.27, 90=9, 99=22975, 99.9=1096703, 99.99=1561599] 
2023-01-09 12:08:07:644 120 sec: 2138200 operations; 17820 current ops/sec; est completion in 7 minutes [INSERT: Count=178200, Max=1986559, Min=6, Avg=5628.94, 90=7, 99=22511, 99.9=1147903, 99.99=1717247] 
2023-01-09 12:08:17:644 130 sec: 2318800 operations; 18060 current ops/sec; est completion in 7 minutes [INSERT: Count=180600, Max=2291711, Min=6, Avg=5536.84, 90=7, 99=18735, 99.9=1132543, 99.99=1665023] 
2023-01-09 12:08:27:644 140 sec: 2498500 operations; 17970 current ops/sec; est completion in 7 minutes [INSERT: Count=179700, Max=2154495, Min=6, Avg=5585.96, 90=8, 99=21375, 99.9=1115135, 99.99=1678335] 
2023-01-09 12:08:37:644 150 sec: 2676700 operations; 17820 current ops/sec; est completion in 6 minutes [INSERT: Count=178200, Max=2115583, Min=6, Avg=5556.98, 90=7, 99=5863, 99.9=1119231, 99.99=1688575] 
2023-01-09 12:08:47:644 160 sec: 2857100 operations; 18040 current ops/sec; est completion in 6 minutes [INSERT: Count=180400, Max=2275327, Min=6, Avg=5570.65, 90=8, 99=23551, 99.9=1123327, 99.99=1671167] 
2023-01-09 12:08:57:644 170 sec: 3038600 operations; 18150 current ops/sec; est completion in 6 minutes [INSERT: Count=181500, Max=2377727, Min=6, Avg=5526.67, 90=8, 99=21103, 99.9=1111039, 99.99=1677311] 
2023-01-09 12:09:07:644 180 sec: 3217300 operations; 17870 current ops/sec; est completion in 6 minutes [INSERT: Count=178700, Max=2254847, Min=6, Avg=5571.1, 90=7, 99=21791, 99.9=1117183, 99.99=1610751] 
2023-01-09 12:09:17:644 190 sec: 3398157 operations; 18085.7 current ops/sec; est completion in 6 minutes [INSERT: Count=181009, Max=2244607, Min=6, Avg=5571.12, 90=8, 99=22287, 99.9=1092607, 99.99=1629183] 
2023-01-09 12:09:27:644 200 sec: 3578300 operations; 18014.3 current ops/sec; est completion in 5 minutes [INSERT: Count=179991, Max=2271231, Min=6, Avg=5450.64, 90=8, 99=19423, 99.9=1097727, 99.99=1701887] 
2023-01-09 12:09:37:644 210 sec: 3758800 operations; 18050 current ops/sec; est completion in 5 minutes [INSERT: Count=180500, Max=2211839, Min=6, Avg=5587.01, 90=8, 99=19711, 99.9=1110015, 99.99=1574911] 
2023-01-09 12:09:47:644 220 sec: 3938300 operations; 17950 current ops/sec; est completion in 5 minutes [INSERT: Count=179500, Max=2328575, Min=6, Avg=5559.33, 90=8, 99=20543, 99.9=1112063, 99.99=1649663] 
2023-01-09 12:09:57:644 230 sec: 4118400 operations; 18010 current ops/sec; est completion in 5 minutes [INSERT: Count=180100, Max=1892351, Min=6, Avg=5566.37, 90=8, 99=20927, 99.9=1102847, 99.99=1603583] 
2023-01-09 12:10:07:644 240 sec: 4296056 operations; 17765.6 current ops/sec; est completion in 5 minutes [INSERT: Count=177700, Max=2099199, Min=6, Avg=5616.51, 90=10, 99=21887, 99.9=1126399, 99.99=1652735] 
2023-01-09 12:10:17:644 250 sec: 4476300 operations; 18024.4 current ops/sec; est completion in 5 minutes [INSERT: Count=180200, Max=2111487, Min=6, Avg=5572.78, 90=8, 99=21359, 99.9=1105919, 99.99=1600511] 
2023-01-09 12:10:27:644 260 sec: 4657500 operations; 18120 current ops/sec; est completion in 4 minutes [INSERT: Count=181200, Max=2085887, Min=6, Avg=5498.39, 90=8, 99=22271, 99.9=1088511, 99.99=1658879] 
2023-01-09 12:10:37:644 270 sec: 4837000 operations; 17950 current ops/sec; est completion in 4 minutes [INSERT: Count=179500, Max=2164735, Min=6, Avg=5596.71, 90=7, 99=20255, 99.9=1088511, 99.99=1588223] 
2023-01-09 12:10:47:644 280 sec: 5017300 operations; 18030 current ops/sec; est completion in 4 minutes [INSERT: Count=180300, Max=2523135, Min=6, Avg=5534.44, 90=8, 99=5183, 99.9=1103871, 99.99=1691647] 
2023-01-09 12:10:57:644 290 sec: 5198800 operations; 18150 current ops/sec; est completion in 4 minutes [INSERT: Count=181500, Max=2160639, Min=6, Avg=5513.44, 90=8, 99=20319, 99.9=1084415, 99.99=1671167] 
2023-01-09 12:11:07:644 300 sec: 5378200 operations; 17940 current ops/sec; est completion in 4 minutes [INSERT: Count=179400, Max=2023423, Min=6, Avg=5586.42, 90=8, 99=22703, 99.9=1096703, 99.99=1639423] 
2023-01-09 12:11:17:644 310 sec: 5531100 operations; 15290 current ops/sec; est completion in 4 minutes [INSERT: Count=152900, Max=3520511, Min=6, Avg=6522.04, 90=8, 99=16495, 99.9=1379327, 99.99=2791423] 
2023-01-09 12:11:27:644 320 sec: 5709700 operations; 17860 current ops/sec; est completion in 4 minutes [INSERT: Count=178600, Max=2418687, Min=6, Avg=5595.11, 90=8, 99=5979, 99.9=1082367, 99.99=1716223] 
2023-01-09 12:11:37:644 330 sec: 5888176 operations; 17847.6 current ops/sec; est completion in 3 minutes [INSERT: Count=178526, Max=2051071, Min=6, Avg=5576.05, 90=8, 99=22751, 99.9=1088511, 99.99=1634303] 
2023-01-09 12:11:47:644 340 sec: 6066300 operations; 17812.4 current ops/sec; est completion in 3 minutes [INSERT: Count=178074, Max=2365439, Min=6, Avg=5605.62, 90=9, 99=21695, 99.9=1120255, 99.99=1727487] 
2023-01-09 12:11:57:644 350 sec: 6245800 operations; 17950 current ops/sec; est completion in 3 minutes [INSERT: Count=179500, Max=2291711, Min=6, Avg=5589.77, 90=9, 99=21807, 99.9=1103871, 99.99=1679359] 
2023-01-09 12:12:07:644 360 sec: 6422800 operations; 17700 current ops/sec; est completion in 3 minutes [INSERT: Count=177000, Max=2037759, Min=6, Avg=5633.59, 90=9, 99=5007, 99.9=1138687, 99.99=1627135] 
2023-01-09 12:12:17:644 370 sec: 6602132 operations; 17933.2 current ops/sec; est completion in 3 minutes [INSERT: Count=179361, Max=2453503, Min=6, Avg=5583.46, 90=8, 99=19775, 99.9=1110015, 99.99=1665023] 
2023-01-09 12:12:27:644 380 sec: 6780800 operations; 17866.8 current ops/sec; est completion in 3 minutes [INSERT: Count=178639, Max=2236415, Min=6, Avg=5582.4, 90=8, 99=21519, 99.9=1103871, 99.99=1660927] 
2023-01-09 12:12:37:644 390 sec: 6960700 operations; 17990 current ops/sec; est completion in 2 minutes [INSERT: Count=179900, Max=2207743, Min=6, Avg=5613.42, 90=7, 99=23151, 99.9=1116159, 99.99=1671167] 
2023-01-09 12:12:47:644 400 sec: 7138300 operations; 17760 current ops/sec; est completion in 2 minutes [INSERT: Count=177600, Max=2293759, Min=6, Avg=5580.83, 90=7, 99=23679, 99.9=1117183, 99.99=1714175] 
2023-01-09 12:12:57:644 410 sec: 7315700 operations; 17740 current ops/sec; est completion in 2 minutes [INSERT: Count=177400, Max=2576383, Min=6, Avg=5638.35, 90=7, 99=21103, 99.9=1125375, 99.99=1777663] 
2023-01-09 12:13:07:644 420 sec: 7493500 operations; 17780 current ops/sec; est completion in 2 minutes [INSERT: Count=177837, Max=2222079, Min=6, Avg=5636.85, 90=8, 99=23631, 99.9=1111039, 99.99=1680383] 
2023-01-09 12:13:17:644 430 sec: 7672300 operations; 17880 current ops/sec; est completion in 2 minutes [INSERT: Count=178763, Max=2089983, Min=6, Avg=5588.91, 90=9, 99=21919, 99.9=1126399, 99.99=1674239] 
2023-01-09 12:13:27:644 440 sec: 7852200 operations; 17990 current ops/sec; est completion in 2 minutes [INSERT: Count=179900, Max=2209791, Min=6, Avg=5589.29, 90=8, 99=21023, 99.9=1080319, 99.99=1666047] 
2023-01-09 12:13:37:644 450 sec: 8031000 operations; 17880 current ops/sec; est completion in 1 minute [INSERT: Count=178800, Max=2334719, Min=6, Avg=5566.14, 90=7, 99=5195, 99.9=1135615, 99.99=1726463] 
2023-01-09 12:13:47:644 460 sec: 8208300 operations; 17730 current ops/sec; est completion in 1 minute [INSERT: Count=177300, Max=2643967, Min=6, Avg=5614.58, 90=8, 99=20335, 99.9=1127423, 99.99=1753087] 
2023-01-09 12:13:57:644 470 sec: 8387500 operations; 17920 current ops/sec; est completion in 1 minute [INSERT: Count=179200, Max=2152447, Min=6, Avg=5622.68, 90=9, 99=22479, 99.9=1150975, 99.99=1681407] 
2023-01-09 12:14:07:644 480 sec: 8562900 operations; 17540 current ops/sec; est completion in 1 minute [INSERT: Count=175400, Max=2096127, Min=6, Avg=5638.76, 90=7, 99=22319, 99.9=1122303, 99.99=1729535] 
2023-01-09 12:14:17:644 490 sec: 8742200 operations; 17930 current ops/sec; est completion in 1 minute [INSERT: Count=179300, Max=2101247, Min=6, Avg=5601.59, 90=9, 99=6375, 99.9=1112063, 99.99=1596415] 
2023-01-09 12:14:27:644 500 sec: 8922200 operations; 18000 current ops/sec; est completion in 1 minute [INSERT: Count=180000, Max=2016255, Min=6, Avg=5549.93, 90=7, 99=20415, 99.9=1079295, 99.99=1618943] 
2023-01-09 12:14:37:644 510 sec: 9099890 operations; 17769 current ops/sec; est completion in 51 seconds [INSERT: Count=177700, Max=2185215, Min=6, Avg=5636.42, 90=7, 99=19119, 99.9=1090559, 99.99=1631231] 
2023-01-09 12:14:47:644 520 sec: 9277100 operations; 17721 current ops/sec; est completion in 41 seconds [INSERT: Count=177200, Max=2013183, Min=6, Avg=5623.47, 90=8, 99=20863, 99.9=1105919, 99.99=1645567] 
2023-01-09 12:14:57:644 530 sec: 9455300 operations; 17820 current ops/sec; est completion in 31 seconds [INSERT: Count=178200, Max=2717695, Min=6, Avg=5637.1, 90=7, 99=21455, 99.9=1158143, 99.99=1721343] 
2023-01-09 12:15:07:644 540 sec: 9630102 operations; 17480.2 current ops/sec; est completion in 21 seconds [CLEANUP: Count=2, Max=5, Min=1, Avg=3, 90=5, 99=5, 99.9=5, 99.99=5] [INSERT: Count=174802, Max=2318335, Min=6, Avg=5714.27, 90=8, 99=23215, 99.9=1123327, 99.99=1754111] 
2023-01-09 12:15:17:644 550 sec: 9808517 operations; 17841.5 current ops/sec; est completion in 11 seconds [CLEANUP: Count=15, Max=2, Min=1, Avg=1.07, 90=1, 99=2, 99.9=2, 99.99=2] [INSERT: Count=178415, Max=1998847, Min=6, Avg=5201.9, 90=8, 99=25391, 99.9=1014271, 99.99=1512447] 
2023-01-09 12:15:27:644 560 sec: 9985187 operations; 17667 current ops/sec; est completion in 1 second [CLEANUP: Count=70, Max=2, Min=0, Avg=0.9, 90=1, 99=2, 99.9=2, 99.99=2] [INSERT: Count=176670, Max=1534975, Min=6, Avg=3238.49, 90=8, 99=31343, 99.9=698367, 99.99=1146879] 
2023-01-09 12:15:28:928 561 sec: 10000000 operations; 11536.6 current ops/sec; [CLEANUP: Count=13, Max=4735, Min=0, Avg=364.77, 90=1, 99=4735, 99.9=4735, 99.99=4735] [INSERT: Count=14813, Max=102143, Min=6, Avg=519.46, 90=12, 99=20415, 99.9=73471, 99.99=101247] 
[OVERALL], RunTime(ms), 561283
[OVERALL], Throughput(ops/sec), 17816.32438538135
[TOTAL_GCS_PS_Scavenge], Count, 810
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 3729
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6643707363308705
[TOTAL_GCS_PS_MarkSweep], Count, 65
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 1408
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.2508538473461694
[TOTAL_GCs], Count, 875
[TOTAL_GC_TIME], Time(ms), 5137
[TOTAL_GC_TIME_%], Time(%), 0.91522458367704
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 48.27
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 4735
[CLEANUP], 95thPercentileLatency(us), 2
[CLEANUP], 99thPercentileLatency(us), 5
[INSERT], Operations, 10000000
[INSERT], AverageLatency(us), 5541.7166993
[INSERT], MinLatency(us), 6
[INSERT], MaxLatency(us), 3520511
[INSERT], 95thPercentileLatency(us), 12
[INSERT], 99thPercentileLatency(us), 21167
[INSERT], Return=OK, 100000
[INSERT], Return=BATCHED_OK, 9900000